<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Datenschuntzerkl&auml;rung</title>
	</head>
	<body>
		<h1>Datenschuntzerkl&auml;rung</h1>
			
		<h2>Name und Anschrift des Verantwortlichen</h2>
		<p>Der Verantwortliche im Sinne der Datenschutz-Grundverordnung und anderer nationaler Datenschutzgesetze der Mitgliedsstaaten 
				sowie sonstiger datenschutzrechtlicher Bestimmungen ist:</p>
		
		<p style="margin-top: 0.4em; margin-bottom: 0;">
		  <a href="http://bioinfweb.info/People/Stoever">Ben St&ouml;ver</a><br />
		</p>
		<p style="margin-top: 0.4em; margin-bottom: 0;">
		  Friesenring 69<br />
		  48147 M&uuml;nster<br />
		  Germany<br />
		</p>
		<p style="margin-top: 0.4em; margin-bottom: 0;"><b>Phone:</b> +49 251 83-21647</p>
		<p style="margin-top:0.4em;">
		  <b>E-Mail:</b> support<img src="http://bioinfweb.info/at.png" alt="at" style="position:relative; top:3px" />bioinfweb.info
		</p>
		
		<h2>Allgemeines zur Datenverarbeitung</h2>
		
		<h3>Umfang der Verarbeitung personenbezogener Daten</h3>
		<p>Wir verarbeiten personenbezogene Daten unserer Nutzer grunds&auml;tzlich nur, soweit dies zur Bereitstellung einer funktionsf&auml;higen 
				Anwendung sowie unserer Inhalte und Leistungen erforderlich ist. Die Verarbeitung personenbezogener Daten unserer Nutzer 
				erfolgt regelm&auml;&szlig;ig nur nach Einwilligung des Nutzers. Eine Ausnahme gilt in solchen F&auml;llen, in denen eine vorherige 
				Einholung einer Einwilligung aus tats&auml;chlichen Gr&uuml;nden nicht m&ouml;glich ist und die Verarbeitung der Daten durch gesetzliche 
				Vorschriften gestattet ist.</p> 
		<p>Pers&ouml;nliche Daten (z.B. IP Adresse und Datum und Uhrzeit eines Zugriffs) werden von unseren Servern erfasst, wenn 
				<i>TreeGraph 2</i> auf unsere Website zugreift, um auf Aktualisierungen zu pr&uuml;fen oder Fehlerberichte zu senden.
				<i>TreeGraph 2</i> sammelt zu keinem Zeitpunkt Daten &uuml;ber den Inhalt von ge&ouml;ffneten Dateien oder Informationen &uuml;ber den
				Computer auf dem die Anwendung ausgef&uuml;hrt wird.</p>   
		
		<h3>Rechtsgrundlage f&uuml;r die Verarbeitung personenbezogener Daten</h3>
		<p>Soweit wir f&uuml;r Verarbeitungsvorg&auml;nge personenbezogener Daten eine Einwilligung der betroffenen Person einholen, dient Art. 6 
				Abs. 1 lit. a EU-Datenschutzgrundverordnung (DSGVO) als Rechtsgrundlage.</p>
		<p>Bei der Verarbeitung von personenbezogenen Daten, die zur Erf&uuml;llung eines Vertrages, dessen Vertragspartei die betroffene 
		Person ist, erforderlich ist, dient Art. 6 Abs. 1 lit. b DSGVO als Rechtsgrundlage. Dies gilt auch f&uuml;r Verarbeitungsvorg&auml;nge, die 
		zur Durchf&uuml;hrung vorvertraglicher Ma&szlig;nahmen erforderlich sind.</p>
		<p>Soweit eine Verarbeitung personenbezogener Daten zur Erf&uuml;llung einer rechtlichen Verpflichtung erforderlich ist, der wir 
			unterliegen, dient Art. 6 Abs. 1 lit. c DSGVO als Rechtsgrundlage.</p>
		<p>F&uuml;r den Fall, dass lebenswichtige Interessen der betroffenen Person oder einer anderen nat&uuml;rlichen Person eine Verarbeitung 
			personenbezogener Daten erforderlich machen, dient Art. 6 Abs. 1 lit. d DSGVO als Rechtsgrundlage.</p>
		<p>Ist die Verarbeitung zur Wahrung unseres berechtigten Interesses oder eines Dritten erforderlich und	&uuml;berwiegen die Interessen, 
			Grundrechte und Grundfreiheiten des Betroffenen das erstgenannte Interesse nicht, so dient Art. 6 Abs. 1 lit. f DSGVO als 
			Rechtsgrundlage f&uuml;r die Verarbeitung.</p> 
			
		<h3>Datenl&ouml;schung und Speicherdauer</h3>
		<p>Die personenbezogenen Daten der betroffenen Person werden gel&ouml;scht oder gesperrt, sobald der Zweck der Speicherung entf&auml;llt. 
				Eine Speicherung kann dar&uuml;ber hinaus erfolgen, wenn dies durch den europ&auml;ischen oder nationalen Gesetzgeber in 
				unionsrechtlichen Verordnungen, Gesetzen oder sonstigen Vorschriften, denen der Verantwortliche unterliegt, vorgesehen 
				wurde. Eine Sperrung oder L&ouml;schung der Daten erfolgt auch dann, wenn eine durch die genannten Normen vorgeschriebene 
				Speicherfrist abl&auml;uft, es sei denn, dass eine Erforderlichkeit zur weiteren Speicherung der Daten f&uuml;r einen Vertragsabschluss 
				oder eine Vertragserf&uuml;llung besteht.</p>
				
		<h2>Bereitstellung der Website und Erstellung von Logfiles bei Anfragen auf Updates und dem Senden von Fehlerberichten durch die Anwendung</h2>
		
		<h3>Beschreibung und Umfang der Datenverarbeitung</h3>
		<p><i>TreeGraph 2</i> greift auf unsere Website zu um zu pr&uuml;fen, ob eine neuere Version verf&uuml;gbar ist. Die Anwendung kontaktiert unsere
				Server um auf Updates zu pr&uuml;fen bei jedem Start, jedoch h&ouml;chstens einmal pro Stunde, falls der Nutzer das &uuml;berpr&uuml;fen auf Updates
				nicht ausgeschaltet hat. Dar&uuml;ber hinaus kann auf die Website zugegriffen werden, um Fehlerberichte zu senden, falls der Nutzer
				dies anst&ouml;&szlig;t. Bei jedem Zugriff auf unsere Website werden von unserem Server automatisch folgenden Informationen erfasst:</p>		
		<ul>
			<li>Die IP-Adresse des Nutzers</li>
			<li>Datum und Uhrzeit des Zugriffs</li>
		</ul>
		<p>Die Daten werden ebenfalls in den Logfiles unseres Systems gespeichert. Eine Speicherung dieser Daten zusammen mit anderen 
				personenbezogenen Daten des Nutzers findet nicht statt.</p>
		
		<h3>Rechtsgrundlage f&uuml;r die Datenverarbeitung</h3>
		<p>Rechtsgrundlage f&uuml;r die vor&uuml;bergehende Speicherung der Daten und der Logfiles ist Art. 6 Abs. 1 lit. f DSGVO.</p>
		
		<h3>Zweck der Datenverarbeitung</h3>
		<p>Die vor&uuml;bergehende Speicherung der IP-Adresse durch das System ist notwendig, um eine Auslieferung der Website an den Rechner 
				des Nutzers zu erm&ouml;glichen. Hierf&uuml;r muss die IP-Adresse des Nutzers f&uuml;r die Dauer der Sitzung gespeichert bleiben.</p>
		<p>Die Speicherung in Logfiles erfolgt, um die Funktionsf&auml;higkeit der Website sicherzustellen. Zudem dienen uns die Daten zur 
				Optimierung der Website und zur Sicherstellung der Sicherheit unserer informationstechnischen Systeme. Eine Auswertung der 
				Daten zu Marketingzwecken findet in diesem Zusammenhang nicht statt.</p>
		<p>In diesen Zwecken liegt auch unser berechtigtes Interesse an der Datenverarbeitung nach Art. 6 Abs. 1 lit. f DSGVO.</p>
		
		<h3>Dauer der Speicherung</h3>
		<p>Die Daten werden gel&ouml;scht, sobald sie f&uuml;r die Erreichung des Zweckes ihrer Erhebung nicht mehr erforderlich sind. Im Falle der 
				Erfassung der Daten zur Bereitstellung der Website ist dies der Fall, wenn die jeweilige Sitzung beendet ist.</p>
		<p>Im Falle der Speicherung der Daten in Logfiles ist dies nach sp&auml;testens sieben Tagen der Fall. Eine dar&uuml;berhinausgehende 
				Speicherung ist m&ouml;glich. In diesem Fall werden die IP-Adressen der Nutzer gel&ouml;scht oder verfremdet, sodass eine Zuordnung 
				des aufrufenden Clients nicht mehr m&ouml;glich ist.</p>
		<p>Ist das Aufbewahren von Daten zur Beweissicherung zur Aufkl&auml;rung von Missbrauchs- oder Betrugshandlungen erforderlich, sind diese 
				bis zur abschlie&szlig;enden Kl&auml;rung des entsprechenden Vorfalls von der L&ouml;schung ausgenommen.</p>
				
		<h3>Widerspruchs- und Beseitigungsm&ouml;glichkeit</h3>
		<p>Die Erfassung der Daten zur Bereitstellung der Website und die Speicherung der Daten in Logfiles ist f&uuml;r den Betrieb der 
				Internetseite zwingend erforderlich. Es besteht folglich seitens des Nutzers keine Widerspruchsm&ouml;glichkeit.</p>
		
		
				
	</body>
</html>